cask_args appdir: "/Applications"

# Install useful stuff
brew "gcc"
brew "make"
brew "cmake"
brew "llvm"
brew "openblas"
brew "coreutils"
brew "wget"
brew "nano"
brew "findutils"
cask "java"
brew "pkg-config"
brew "git"
brew "zsh"
brew "getantibody/tap/antibody"
brew "python3"
brew "rbenv"
brew "ruby-build"
brew "node"
brew "yarn"
brew "r", args: ["with-java", "with-openblas"]
brew "pandoc"
brew "pandoc-citeproc"
brew "gnupg"
brew "pinentry-mac"


cask "alfred"
cask "google-chrome"
cask "firefox"
cask "the-unarchiver"
cask "dropbox"
cask "spotify"
cask "1password"
cask "flux"
cask "github-desktop"
cask "visual-studio-code"
cask "rstudio"
cask "skype"
cask "evernote"
cask "iterm2"
cask "slack"
cask "hazel"
cask "mactex"
cask "vlc"
cask "xquartz"