cask_args appdir: "/Applications"

# Install useful stuff
brew "gcc"
brew "make"
brew "cmake"
brew "llvm"
brew "openblas"
brew "libomp"
brew "coreutils"
brew "wget"
brew "nano"
brew "findutils"
brew "pkg-config"
brew "git"
brew "zsh"
brew "antibody"
brew "python3"
brew "virtualenv"
brew "pipx"
brew "pandoc"
brew "gnupg"
brew "pinentry-mac"
brew "libtiff"
brew "libpng"
brew "jpeg-turbo"
brew "freetype"
brew "openssl"
brew "zstd"

cask "1password"
cask "dropbox"
cask "alfred"
cask "iterm2"
cask "xquartz"
cask "google-chrome"
cask "firefox"
cask "the-unarchiver"
cask "github"
cask "spotify"
cask "hazel"
cask "zoom"
cask "slack"
cask "notion"
cask "zotero"
cask "freedom"
cask "microsoft-office"
cask "vlc"
cask "zerotier-one"
cask "r"
cask "rstudio"
cask "mactex-no-gui"